{
	"name": 	 "Wolfpack Island",
	"thumb":	 "wpi1.jpg",
	"image2":	 "wpi2.gif",
	"image3":	 "wpi3.png",
	"title":	 "lead programmer",
	"time":		 "March 2021 - Current",
	"shortDes":  "an MMO in the vein of virtual worlds like Club Penguin",
	"section1":  "<p>Wolfpack Island is a virtual world similar to games like Club Penguin. Through this project I've learned a lot about NodeJS, as well as developing some features I'm really proud of.</p><p>When I began, many assets like clothing and backgrounds were baked directly into the game binaries - I spent a week pulling apart the already huge codebase so that we could deliver assets for clothing and areas on game start, and whenever there were new items available while users are playing. This allows us to make itterative modifications to the look and feel of the game without needing to distribute new binaries every week. Doing this also substantially reduced the size of the app binaries, and improved performance significantly on low-end devices by optimizing texture storage.</p><p>Another feature I completely built was Player to Player trading, which creates secure data containers on our backend to create a virtualized tunneled connection between two clients, while ensuring trade-validity to prevent item duplication and other pitfalls of player to player trading.</p><p>On top of many features I've worked on for the game, working on Wolfpack Island has given me solid understanding and knowledge of distribution for Steam, Google Play, and the Apple App Store (Mac App Store included). I've streamlined our build toolchain and distribution toolchain to make sending out updates and play tests a breeze saving many hours of headaches each time we need to make a binary release.</p><p class='whitebox'><i>\"I don't think I could have found anyone else as dedicated, enthusiast and as supportive as Brian. He is always going the extra mile, and I know my project wouldn't be as great as it is today if it wasn't for him being on board\"</i><br>- <b>Ewan Kennedy</b> (Client)</p>",
	"section2":  {
					"Developer":		"Zeptars Ltd.",
					"Platforms":		"Windows, macOS, Android, iOS",
					"Technologies": 	"NodeJS, VueJS, PHP, MySQL, and GameMaker Studio 2",
					"Responsibilities": "<ul><li>Implement, test, and deploy new game features and moderation tools throughout entire stack</li><li>Design and develop content creation tools, and systems for rapid deployment without client software updates</li><li>Audit, assess, and resolve security concerns</li><li>Ensure successful cross-platform builds</li><li>Deploy client software to Apple App Stores, Google Play, and Steam</li></ul>",
					"Links":			"<a href='https://store.steampowered.com/app/1031970/Wolfpack_Island/'>Steam</a> / <a href='https://play.google.com/store/apps/details?id=com.zeptarsltd.wolfpackisland'>Google Play</a> / <a href='https://apps.apple.com/ao/app/wolfpack-island/id1453048068'>App Store</a> / <a href='https://twitter.com/wolfpackisland'>Twitter</a>"
				 }
}
